Autodesk.Navisworks.Api.NwdExportOptions


Autodesk.Navisworks.Api.NwdExportOptions.#ctor
Default constructor

Autodesk.Navisworks.Api.NwdExportOptions.EmbedXrefs
Should any externally referenced files including ReCap scans and textures be embedded in the exported file?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.NwdExportOptions.ExcludeHiddenItems
Should hidden ModelItems be removed from the exported file?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.NwdExportOptions.FileVersion
File version to write out to.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.NwdExportOptions.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.NwdExportOptions.PreventObjectPropertyExport
Should normal object properties be removed from the exported file?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only